Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.81/edc/PIC32MZ1064DAS169.PIC
      <edc:SFRDef edc:_addr="0x1F800080" edc:_begin="0x20" edc:_end="0xb0" edc:_modsrc="DOS-02787_WACB_Config.Module" edc:_refcount="2" edc:access="--nn---n---nnnnn--nnnnnn--nnnnnn" edc:cname="PMD5" edc:desc="" edc:impl="0x311f3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--00---0---00000--000000--000000" edc:name="PMD5" edc:nzwidth="0x20" edc:por="--00---0---00000--000000--000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CFG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U1MD" edc:desc="" edc:mask="0x1" edc:name="U1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U2MD" edc:desc="" edc:mask="0x1" edc:name="U2MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U3MD" edc:desc="" edc:mask="0x1" edc:name="U3MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U4MD" edc:desc="" edc:mask="0x1" edc:name="U4MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U5MD" edc:desc="" edc:mask="0x1" edc:name="U5MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U6MD" edc:desc="" edc:mask="0x1" edc:name="U6MD" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="SPI1MD" edc:desc="" edc:mask="0x1" edc:name="SPI1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI2MD" edc:desc="" edc:mask="0x1" edc:name="SPI2MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI3MD" edc:desc="" edc:mask="0x1" edc:name="SPI3MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI4MD" edc:desc="" edc:mask="0x1" edc:name="SPI4MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI5MD" edc:desc="" edc:mask="0x1" edc:name="SPI5MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI6MD" edc:desc="" edc:mask="0x1" edc:name="SPI6MD" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="I2C1MD" edc:desc="" edc:mask="0x1" edc:name="I2C1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C2MD" edc:desc="" edc:mask="0x1" edc:name="I2C2MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C3MD" edc:desc="" edc:mask="0x1" edc:name="I2C3MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C4MD" edc:desc="" edc:mask="0x1" edc:name="I2C4MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C5MD" edc:desc="" edc:mask="0x1" edc:name="I2C5MD" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="USBMD" edc:desc="" edc:mask="0x1" edc:name="USBMD" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CAN1MD" edc:desc="" edc:mask="0x1" edc:name="CAN1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CAN2MD" edc:desc="" edc:mask="0x1" edc:name="CAN2MD" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800090" edc:_begin="0x20" edc:_end="0xb0" edc:_modsrc="DOS-02787_WACB_Config.Module" edc:_refcount="2" edc:access="---n----n-nn-nnn---nnnnn-------n" edc:cname="PMD6" edc:desc="" edc:impl="0x10B71f01" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---0----0-----00---00000-------0" edc:name="PMD6" edc:nzwidth="0x20" edc:por="---0----0-----00---00000-------0" edc:portals="CLR SET INV" ltx:memberofperipheral="CFG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="REFO1MD" edc:desc="" edc:mask="0x1" edc:name="REFO1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="REFO2MD" edc:desc="" edc:mask="0x1" edc:name="REFO2MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="REFO3MD" edc:desc="" edc:mask="0x1" edc:name="REFO3MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="REFO4MD" edc:desc="" edc:mask="0x1" edc:name="REFO4MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="REFO5MD" edc:desc="" edc:mask="0x1" edc:name="REFO5MD" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="PMPMD" edc:desc="" edc:mask="0x1" edc:name="PMPMD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EBIMD" edc:desc="" edc:mask="0x1" edc:name="EBIMD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GPUMD" edc:desc="" edc:mask="0x1" edc:name="GPUMD" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="GLCDMD" edc:desc="" edc:mask="0x1" edc:name="GLCD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SDHCMD" edc:desc="" edc:mask="0x1" edc:name="SDHC" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SQI1MD" edc:desc="" edc:mask="0x1" edc:name="SQIMD" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="ETHMD" edc:desc="" edc:mask="0x1" edc:name="ETHMD" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8000A0" edc:_begin="0x20" edc:_end="0xb0" edc:_modsrc="DOS-02787_WACB_Config.Module" edc:_refcount="2" edc:access="---n-----n-n---------------n----" edc:cname="PMD7" edc:desc="" edc:impl="0x10500010" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---1-----0-0---------------0----" edc:name="PMD7" edc:nzwidth="0x20" edc:por="---1-----0-0---------------0----" edc:portals="CLR SET INV" ltx:memberofperipheral="CFG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="DMAMD" edc:desc="" edc:mask="0x1" edc:name="DMAMD" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="15"/>
            <edc:SFRFieldDef edc:cname="RNGMD" edc:desc="" edc:mask="0x1" edc:name="RNGMD" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CRYPTMD" edc:desc="" edc:mask="0x1" edc:name="CRYPTMD" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="DDR2CMD" edc:desc="" edc:mask="0x1" edc:name="DDR2CMD" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8000B0" edc:offset="16"/>
      <edc:SFRDef edc:_addr="0x1F8000C0" edc:_begin="0xc0" edc:_end="0xc4" edc:_modsrc="DOS-02787_WACB_Config.Module" edc:_refcount="3" edc:access="n-------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFGEBIA" edc:desc="" edc:impl="0x80ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-------000000000000000000000000" edc:name="CFGEBIA" edc:nzwidth="32" edc:por="0-------000000000000000000000000" ltx:memberofperipheral="CFG">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EBIA0EN" edc:desc="" edc:mask="0x1" edc:name="EBIA0EN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EBIA1EN" edc:desc="" edc:mask="0x1" edc:name="EBIA1EN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EBIA2EN" edc:desc="" edc:mask="0x1" edc:name="EBIA2EN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EBIA3EN" edc:desc="" edc:mask="0x1" edc:name="EBIA3EN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EBIA4EN" edc:desc="" edc:mask="0x1" edc:name="EBIA4EN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EBIA5EN" edc:desc="" edc:mask="0x1" edc:name="EBIA5EN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EBIA6EN" edc:desc="" edc:mask="0x1" edc:name="EBIA6EN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EBIA7EN" edc:desc="" edc:mask="0x1" edc:name="EBIA7EN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EBIA8EN" edc:desc="" edc:mask="0x1" edc:name="EBIA8EN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EBIA9EN" edc:desc="" edc:mask="0x1" edc:name="EBIA9EN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EBIA10EN" edc:desc="" edc:mask="0x1" edc:name="EBIA10EN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EBIA11EN" edc:desc="" edc:mask="0x1" edc:name="EBIA11EN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EBIA12EN" edc:desc="" edc:mask="0x1" edc:name="EBIA12EN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EBIA13EN" edc:desc="" edc:mask="0x1" edc:name="EBIA13EN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EBIA14EN" edc:desc="" edc:mask="0x1" edc:name="EBIA14EN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EBIA15EN" edc:desc="" edc:mask="0x1" edc:name="EBIA15EN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EBIA16EN" edc:desc="" edc:mask="0x1" edc:name="EBIA16EN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EBIA17EN" edc:desc="" edc:mask="0x1" edc:name="EBIA17EN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EBIA18EN" edc:desc="" edc:mask="0x1" edc:name="EBIA18EN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EBIA19EN" edc:desc="" edc:mask="0x1" edc:name="EBIA19EN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EBIA20EN" edc:desc="" edc:mask="0x1" edc:name="EBIA20EN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EBIA21EN" edc:desc="" edc:mask="0x1" edc:name="EBIA21EN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EBIA22EN" edc:desc="" edc:mask="0x1" edc:name="EBIA22EN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EBIA23EN" edc:desc="" edc:mask="0x1" edc:name="EBIA23EN" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8000C4" edc:offset="12"/>
      <edc:SFRDef edc:_addr="0x1F8000D0" edc:_begin="0xc4" edc:_end="0xc8" edc:_modsrc="DOS-02787_WACB_Config.Module" edc:_refcount="4" edc:access="nnn-nnn-------nn--nn--nnnnnn--nn" edc:cname="CFGEBIC" edc:desc="" edc:impl="0xee0333f3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000-000-------00--00--000000--00" edc:name="CFGEBIC" edc:nzwidth="32" edc:por="000-000-------00--00--000000--00" ltx:memberofperipheral="CFG">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EBIDEN0" edc:desc="" edc:mask="0x1" edc:name="EBIDEN0" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EBIDEN1" edc:desc="" edc:mask="0x1" edc:name="EBIDEN1" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="EBICSEN0" edc:desc="" edc:mask="0x1" edc:name="EBICSEN0" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EBICSEN1" edc:desc="" edc:mask="0x1" edc:name="EBICSEN1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EBICSEN2" edc:desc="" edc:mask="0x1" edc:name="EBICSEN2" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EBICSEN3" edc:desc="" edc:mask="0x1" edc:name="EBICSEN3" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EBIBSEN0" edc:desc="" edc:mask="0x1" edc:name="EBIBSEN0" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EBIBSEN1" edc:desc="" edc:mask="0x1" edc:name="EBIBSEN1" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="EBIOEEN" edc:desc="" edc:mask="0x1" edc:name="EBIOEEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EBIWEEN" edc:desc="" edc:mask="0x1" edc:name="EBIWEEN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="EBIRPEN" edc:desc="" edc:mask="0x1" edc:name="EBIRPEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EBIRDYLVL" edc:desc="" edc:mask="0x1" edc:name="EBIRDYLVL" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="7"/>
            <edc:SFRFieldDef edc:cname="EBIRDYEN1" edc:desc="" edc:mask="0x1" edc:name="EBIRDYEN1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EBIRDYEN2" edc:desc="" edc:mask="0x1" edc:name="EBIRDYEN2" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EBIRDYEN3" edc:desc="" edc:mask="0x1" edc:name="EBIRDYEN3" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="EBIRDYINV1" edc:desc="" edc:mask="0x1" edc:name="EBIRDYINV1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EBIRDYINV2" edc:desc="" edc:mask="0x1" edc:name="EBIRDYINV2" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EBIRDYINV3" edc:desc="" edc:mask="0x1" edc:name="EBIRDYINV3" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8000D4" edc:offset="12"/>
      <edc:SFRDef edc:_addr="0x1F8000E0" edc:_begin="0xc8" edc:_end="0x110" edc:_modsrc="DOS-02787_WACB_Config.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnn--nn--nn--nn" edc:cname="CFGPG" edc:desc="" edc:impl="0xfffff333" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uu000000000000000000--00--00--00" edc:name="CFGPG" edc:nzwidth="32" edc:por="xx000000000000000000--00--00--00" edc:portals="- - -" ltx:memberofperipheral="CFG">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CPUPG" edc:desc="" edc:mask="0x3" edc:name="CPUPG" edc:nzwidth="2"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="DMAPG" edc:desc="" edc:mask="0x3" edc:name="DMAPG" edc:nzwidth="2"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="USBPG" edc:desc="" edc:mask="0x3" edc:name="USBPG" edc:nzwidth="2"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="CAN1PG" edc:desc="" edc:mask="0x3" edc:name="CAN1PG" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CAN2PG" edc:desc="" edc:mask="0x3" edc:name="CAN2PG" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ETHPG" edc:desc="" edc:mask="0x3" edc:name="ETHPG" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SDHCPG" edc:desc="" edc:mask="0x3" edc:name="SDHCPG" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SQI1PG" edc:desc="" edc:mask="0x3" edc:name="SQI1PG" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="FCPG" edc:desc="" edc:mask="0x3" edc:name="FCPG" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CRYPTPG" edc:desc="" edc:mask="0x3" edc:name="CRYPTPG" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="GLCDPG" edc:desc="" edc:mask="0x3" edc:name="GLCDPG" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="GPUPG" edc:desc="" edc:mask="0x3" edc:name="GPUPG" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ICD1PG" edc:mask="0x3" edc:name="ICD1PG" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
