Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.81/edc/PIC32MZ1064DAS169.PIC
      <edc:SFRDef edc:_addr="0x1F8EA004" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="1" edc:access="------------------nnnnnn--nnnnnn" edc:cname="GLCDCLKCON" edc:desc="" edc:impl="0x3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------000000--000000" edc:name="GLCDCLKCON" edc:nzwidth="32" edc:por="------------------000000--000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CLKDIV" edc:desc="" edc:mask="0x3f" edc:name="CLKDIV" edc:nzwidth="6"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="LPREFETCH" edc:desc="" edc:mask="0x3f" edc:name="LPREFETCH" edc:nzwidth="6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA008" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDBGCOLOR" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDBGCOLOR" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ALPHA" edc:desc="" edc:mask="0xff" edc:name="ALPHA" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="BLUE" edc:desc="" edc:mask="0xff" edc:name="BLUE" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="GREEN" edc:desc="" edc:mask="0xff" edc:name="GREEN" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="RED" edc:desc="" edc:mask="0xff" edc:name="RED" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA00C" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="1" edc:access="-----nnnnnnnnnnn-----nnnnnnnnnnn" edc:cname="GLCDRES" edc:desc="" edc:impl="0x7ff07ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----00000000000-----00000000000" edc:name="GLCDRES" edc:nzwidth="32" edc:por="-----00000000000-----00000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:access="" edc:id="DS.0" edc:mclr="" edc:por="">
            <edc:SFRFieldDef edc:cname="RESY" edc:desc="" edc:mask="0x7ff" edc:name="RESY" edc:nzwidth="11"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="RESX" edc:desc="" edc:mask="0x7ff" edc:name="RESX" edc:nzwidth="11"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8EA010" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="1" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x1F8EA014" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="1" edc:access="-----nnnnnnnnnnn-----nnnnnnnnnnn" edc:cname="GLCDFPORCH" edc:desc="" edc:impl="0x7ff07ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----00000000000-----00000000000" edc:name="GLCDFPORCH" edc:nzwidth="32" edc:por="-----00000000000-----00000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:access="" edc:id="DS.0" edc:mclr="" edc:por="">
            <edc:SFRFieldDef edc:cname="FPORCHY" edc:desc="" edc:mask="0x7ff" edc:name="FPORCHY" edc:nzwidth="11"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="FPORCHX" edc:desc="" edc:mask="0x7ff" edc:name="FPORCHX" edc:nzwidth="11"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA018" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="1" edc:access="-----nnnnnnnnnnn-----nnnnnnnnnnn" edc:cname="GLCDBLANKING" edc:desc="" edc:impl="0x7ff07ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----00000000000-----00000000000" edc:name="GLCDBLANKING" edc:nzwidth="32" edc:por="-----00000000000-----00000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BLANKINGY" edc:desc="" edc:mask="0x7ff" edc:name="BLANKINGY" edc:nzwidth="11"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="BLANKINGX" edc:desc="" edc:mask="0x7ff" edc:name="BLANKINGX" edc:nzwidth="11"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA01C" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="1" edc:access="-----nnnnnnnnnnn-----nnnnnnnnnnn" edc:cname="GLCDBPORCH" edc:desc="" edc:impl="0x7ff07ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----00000000000-----00000000000" edc:name="GLCDBPORCH" edc:nzwidth="32" edc:por="-----00000000000-----00000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BPORCHY" edc:desc="" edc:mask="0x7ff" edc:name="BPORCHY" edc:nzwidth="11"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="BPORCHX" edc:desc="" edc:mask="0x7ff" edc:name="BPORCHX" edc:nzwidth="11"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA020" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="1" edc:access="-----nnnnnnnnnnn-----nnnnnnnnnnn" edc:cname="GLCDCURSOR" edc:desc="" edc:impl="0x7ff07ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----00000000000-----00000000000" edc:name="GLCDCURSOR" edc:nzwidth="32" edc:por="-----00000000000-----00000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CURSORY" edc:desc="" edc:mask="0x7ff" edc:name="CURSORY" edc:nzwidth="11"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="CURSORX" edc:desc="" edc:mask="0x7ff" edc:name="CURSORX" edc:nzwidth="11"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8EA024" edc:offset="0xc"/>
      <edc:SFRDef edc:_addr="0x1F8EA030" edc:_begin="0x24" edc:_end="0x3c" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="2" edc:access="nn------nnnnnnnnnnnnnnnn----nnnn" edc:cname="GLCDL0MODE" edc:desc="" edc:impl="0xc0ffff0f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00------0000000000000000----0000" edc:name="GLCDL0MODE" edc:nzwidth="32" edc:por="00------0000000000000000----0000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="COLORMODE" edc:desc="" edc:mask="0xf" edc:name="COLORMODE" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="SRCBLEND" edc:desc="" edc:mask="0xf" edc:name="SRCBLEND" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="DESTBLEND" edc:desc="" edc:mask="0xf" edc:name="DESTBLEND" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="ALPHA" edc:desc="" edc:mask="0xff" edc:name="RED" edc:nzwidth="8"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="MULALPHA" edc:desc="" edc:mask="0x1" edc:name="MULALPHA" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FORCEALPHA" edc:desc="" edc:mask="0x1" edc:name="FORCEALPHA" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DISABIFIL" edc:desc="" edc:mask="0x1" edc:name="DISABIFIL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LAYEREN" edc:desc="" edc:mask="0x1" edc:name="LAYEREN" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA034" edc:_begin="0x24" edc:_end="0x3c" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="2" edc:access="-----nnnnnnnnnnn-----nnnnnnnnnnn" edc:cname="GLCDL0START" edc:desc="" edc:impl="0x7ff07ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----00000000000-----00000000000" edc:name="GLCDL0START" edc:nzwidth="32" edc:por="-----00000000000-----00000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="STARTY" edc:desc="" edc:mask="0x7ff" edc:name="STARTY" edc:nzwidth="11"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="STARTX" edc:desc="" edc:mask="0x7ff" edc:name="STARTX" edc:nzwidth="11"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
