Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.81/edc/PIC32MZ1064DAS169.PIC
      <edc:SFRDef edc:_addr="0x1F8EA53C" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCLUT79" edc:desc="" edc:impl="0x00ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------000000000000000000000000" edc:name="GLCDCLUT79" edc:nzwidth="32" edc:por="--------000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BLUE" edc:desc="" edc:mask="0xff" edc:name="BLUE" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="GREEN" edc:desc="" edc:mask="0xff" edc:name="GREEN" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="RED" edc:desc="" edc:mask="0xff" edc:name="RED" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA540" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCLUT80" edc:desc="" edc:impl="0x00ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------000000000000000000000000" edc:name="GLCDCLUT80" edc:nzwidth="32" edc:por="--------000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BLUE" edc:desc="" edc:mask="0xff" edc:name="BLUE" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="GREEN" edc:desc="" edc:mask="0xff" edc:name="GREEN" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="RED" edc:desc="" edc:mask="0xff" edc:name="RED" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA544" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCLUT81" edc:desc="" edc:impl="0x00ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------000000000000000000000000" edc:name="GLCDCLUT81" edc:nzwidth="32" edc:por="--------000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BLUE" edc:desc="" edc:mask="0xff" edc:name="BLUE" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="GREEN" edc:desc="" edc:mask="0xff" edc:name="GREEN" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="RED" edc:desc="" edc:mask="0xff" edc:name="RED" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA548" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCLUT82" edc:desc="" edc:impl="0x00ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------000000000000000000000000" edc:name="GLCDCLUT82" edc:nzwidth="32" edc:por="--------000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BLUE" edc:desc="" edc:mask="0xff" edc:name="BLUE" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="GREEN" edc:desc="" edc:mask="0xff" edc:name="GREEN" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="RED" edc:desc="" edc:mask="0xff" edc:name="RED" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA54C" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCLUT83" edc:desc="" edc:impl="0x00ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------000000000000000000000000" edc:name="GLCDCLUT83" edc:nzwidth="32" edc:por="--------000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BLUE" edc:desc="" edc:mask="0xff" edc:name="BLUE" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="GREEN" edc:desc="" edc:mask="0xff" edc:name="GREEN" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="RED" edc:desc="" edc:mask="0xff" edc:name="RED" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA550" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCLUT84" edc:desc="" edc:impl="0x00ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------000000000000000000000000" edc:name="GLCDCLUT84" edc:nzwidth="32" edc:por="--------000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BLUE" edc:desc="" edc:mask="0xff" edc:name="BLUE" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="GREEN" edc:desc="" edc:mask="0xff" edc:name="GREEN" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="RED" edc:desc="" edc:mask="0xff" edc:name="RED" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA554" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCLUT85" edc:desc="" edc:impl="0x00ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------000000000000000000000000" edc:name="GLCDCLUT85" edc:nzwidth="32" edc:por="--------000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BLUE" edc:desc="" edc:mask="0xff" edc:name="BLUE" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="GREEN" edc:desc="" edc:mask="0xff" edc:name="GREEN" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="RED" edc:desc="" edc:mask="0xff" edc:name="RED" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA558" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCLUT86" edc:desc="" edc:impl="0x00ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------000000000000000000000000" edc:name="GLCDCLUT86" edc:nzwidth="32" edc:por="--------000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BLUE" edc:desc="" edc:mask="0xff" edc:name="BLUE" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="GREEN" edc:desc="" edc:mask="0xff" edc:name="GREEN" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="RED" edc:desc="" edc:mask="0xff" edc:name="RED" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA55C" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCLUT87" edc:desc="" edc:impl="0x00ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------000000000000000000000000" edc:name="GLCDCLUT87" edc:nzwidth="32" edc:por="--------000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BLUE" edc:desc="" edc:mask="0xff" edc:name="BLUE" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="GREEN" edc:desc="" edc:mask="0xff" edc:name="GREEN" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="RED" edc:desc="" edc:mask="0xff" edc:name="RED" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA560" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCLUT88" edc:desc="" edc:impl="0x00ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------000000000000000000000000" edc:name="GLCDCLUT88" edc:nzwidth="32" edc:por="--------000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BLUE" edc:desc="" edc:mask="0xff" edc:name="BLUE" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="GREEN" edc:desc="" edc:mask="0xff" edc:name="GREEN" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="RED" edc:desc="" edc:mask="0xff" edc:name="RED" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA564" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCLUT89" edc:desc="" edc:impl="0x00ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------000000000000000000000000" edc:name="GLCDCLUT89" edc:nzwidth="32" edc:por="--------000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BLUE" edc:desc="" edc:mask="0xff" edc:name="BLUE" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="GREEN" edc:desc="" edc:mask="0xff" edc:name="GREEN" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="RED" edc:desc="" edc:mask="0xff" edc:name="RED" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA568" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCLUT90" edc:desc="" edc:impl="0x00ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------000000000000000000000000" edc:name="GLCDCLUT90" edc:nzwidth="32" edc:por="--------000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BLUE" edc:desc="" edc:mask="0xff" edc:name="BLUE" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="GREEN" edc:desc="" edc:mask="0xff" edc:name="GREEN" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="RED" edc:desc="" edc:mask="0xff" edc:name="RED" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA56C" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCLUT91" edc:desc="" edc:impl="0x00ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------000000000000000000000000" edc:name="GLCDCLUT91" edc:nzwidth="32" edc:por="--------000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BLUE" edc:desc="" edc:mask="0xff" edc:name="BLUE" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="GREEN" edc:desc="" edc:mask="0xff" edc:name="GREEN" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="RED" edc:desc="" edc:mask="0xff" edc:name="RED" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA570" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCLUT92" edc:desc="" edc:impl="0x00ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------000000000000000000000000" edc:name="GLCDCLUT92" edc:nzwidth="32" edc:por="--------000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BLUE" edc:desc="" edc:mask="0xff" edc:name="BLUE" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="GREEN" edc:desc="" edc:mask="0xff" edc:name="GREEN" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="RED" edc:desc="" edc:mask="0xff" edc:name="RED" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
